[
    {
      "id": 1,
      "name": "Spaghetti Carbonara",
      "image": "https://www.example.com/images/spaghetti-carbonara.jpg",
      "description": "A classic Italian pasta dish with eggs, bacon, and Parmesan cheese.",
      "ingredients": [
        "1 pound spaghetti",
        "4 eggs",
        "1/2 pound bacon, diced",
        "1 cup grated Parmesan cheese",
        "1/4 teaspoon black pepper"
      ],
      "instructions": [
        "Cook spaghetti in a large pot of boiling salted water until al dente.",
        "While spaghetti is cooking, whisk together eggs, Parmesan cheese, and black pepper in a bowl.",
        "Cook bacon in a large skillet over medium heat until crisp.",
        "Remove skillet from heat and add cooked spaghetti to skillet, tossing to combine with bacon.",
        "Add egg mixture to skillet and toss until eggs are cooked and spaghetti is coated with sauce.",
        "Serve hot."
      ]
    },
    {
      "id": 2,
      "name": "Chicken Curry",
      "image": "https://www.example.com/images/chicken-curry.jpg",
      "description": "A flavorful Indian curry with chicken, tomatoes, and spices.",
      "ingredients": [
        "1 pound boneless, skinless chicken breasts, cut into bite-sized pieces",
        "1 onion, chopped",
        "1 tablespoon minced garlic",
        "1 tablespoon minced ginger",
        "1 can diced tomatoes",
        "1 tablespoon curry powder",
        "1/4 teaspoon cayenne pepper",
        "1/4 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1/2 cup heavy cream"
      ],
      "instructions": [
        "Heat oil in a large skillet over medium-high heat.",
        "Add chicken and cook until browned, about 5 minutes.",
        "Remove chicken from skillet and set aside.",
        "Add onion, garlic, and ginger to skillet and cook until onion is translucent, about 5 minutes.",
        "Stir in diced tomatoes, curry powder, cayenne pepper, salt, and black pepper.",
        "Add chicken back to skillet and stir to combine.",
        "Reduce heat to low and simmer for 20 minutes.",
        "Stir in heavy cream and cook for an additional 5 minutes.",
        "Serve hot over rice or with naan bread."
      ]
    }
  ]
  
